turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3s/atdf/ATSAM3S2B.atdf
      <value-group caption="" name="HSMCI_CMDR__MAXLAT">
        <value caption="5-cycle max latency." name="_5" value="0"/>
        <value caption="64-cycle max latency." name="_64" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRCMD">
        <value caption="No data transfer" name="NO_DATA" value="0x0"/>
        <value caption="Start data transfer" name="START_DATA" value="0x1"/>
        <value caption="Stop data transfer" name="STOP_DATA" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRDIR">
        <value caption="Write." name="WRITE" value="0"/>
        <value caption="Read." name="READ" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRTYP">
        <value caption="MMC/SD Card Single Block" name="SINGLE" value="0x0"/>
        <value caption="MMC/SD Card Multiple Block" name="MULTIPLE" value="0x1"/>
        <value caption="MMC Stream" name="STREAM" value="0x2"/>
        <value caption="SDIO Byte" name="BYTE" value="0x4"/>
        <value caption="SDIO Block" name="BLOCK" value="0x5"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__IOSPCMD">
        <value caption="Not an SDIO Special Command" name="STD" value="0x0"/>
        <value caption="SDIO Suspend Command" name="SUSPEND" value="0x1"/>
        <value caption="SDIO Resume Command" name="RESUME" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__ATACS">
        <value caption="Normal operation mode." name="NORMAL" value="0"/>
        <value caption="This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR)." name="COMPLETION" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CSTOR__CSTOMUL">
        <value caption="CSTOCYC x 1" name="_1" value="0x0"/>
        <value caption="CSTOCYC x 16" name="_16" value="0x1"/>
        <value caption="CSTOCYC x 128" name="_128" value="0x2"/>
        <value caption="CSTOCYC x 256" name="_256" value="0x3"/>
        <value caption="CSTOCYC x 1024" name="_1024" value="0x4"/>
        <value caption="CSTOCYC x 4096" name="_4096" value="0x5"/>
        <value caption="CSTOCYC x 65536" name="_65536" value="0x6"/>
        <value caption="CSTOCYC x 1048576" name="_1048576" value="0x7"/>
      </value-group>
      <value-group caption="" name="HSMCI_WPSR__WP_VS">
        <value caption="No Write Protection Violation occurred since the last read of this register (WP_SR)" name="NONE" value="0x0"/>
        <value caption="Write Protection detected unauthorized attempt to write a control register had occurred (since the last read.)" name="WRITE" value="0x1"/>
        <value caption="Software reset had been performed while Write Protection was enabled (since the last read)." name="RESET" value="0x2"/>
        <value caption="Both Write Protection violation and software reset with Write Protection enabled have occurred since the last read." name="BOTH" value="0x3"/>
      </value-group>
    </module>
    <module caption="AHB Bus Matrix" name="MATRIX" version="6499A">
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 3" name="MATRIX_MCFG3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 1" name="MATRIX_SCFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 2" name="MATRIX_SCFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 3" name="MATRIX_SCFG3" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 4" name="MATRIX_SCFG4" offset="0x50" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
