turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3s/atdf/ATSAM3S2B.atdf
        <register caption="Counter Value (channel = 2)" name="TC_CV2" offset="0x90" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A (channel = 2)" name="TC_RA2" offset="0x94" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B (channel = 2)" name="TC_RB2" offset="0x98" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C (channel = 2)" name="TC_RC2" offset="0x9C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Status Register (channel = 2)" name="TC_SR2" offset="0xA0" rw="R" size="4">
          <bitfield caption="Counter Overflow Status" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOA Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOB Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Interrupt Enable Register (channel = 2)" name="TC_IER2" offset="0xA4" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Disable Register (channel = 2)" name="TC_IDR2" offset="0xA8" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Mask Register (channel = 2)" name="TC_IMR2" offset="0xAC" rw="R" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Block Control Register" name="TC_BCR" offset="0xC0" rw="W" size="4">
          <bitfield caption="Synchro Command" mask="0x00000001" name="SYNC"/>
        </register>
        <register caption="Block Mode Register" name="TC_BMR" offset="0xC4" rw="RW" size="4">
          <bitfield caption="External Clock Signal 0 Selection" mask="0x00000003" name="TC0XC0S" values="TC_BMR__TC0XC0S"/>
          <bitfield caption="External Clock Signal 1 Selection" mask="0x0000000C" name="TC1XC1S" values="TC_BMR__TC1XC1S"/>
          <bitfield caption="External Clock Signal 2 Selection" mask="0x00000030" name="TC2XC2S" values="TC_BMR__TC2XC2S"/>
          <bitfield caption="Quadrature Decoder ENabled" mask="0x00000100" name="QDEN"/>
          <bitfield caption="POSition ENabled" mask="0x00000200" name="POSEN"/>
          <bitfield caption="SPEED ENabled" mask="0x00000400" name="SPEEDEN"/>
          <bitfield caption="Quadrature Decoding TRANSparent" mask="0x00000800" name="QDTRANS"/>
          <bitfield caption="EDGe on PHA count mode" mask="0x00001000" name="EDGPHA"/>
          <bitfield caption="INVerted phA" mask="0x00002000" name="INVA"/>
          <bitfield caption="INVerted phB" mask="0x00004000" name="INVB"/>
          <bitfield caption="INVerted InDeX" mask="0x00008000" name="INVIDX"/>
          <bitfield caption="SWAP PHA and PHB" mask="0x00010000" name="SWAP"/>
          <bitfield caption="InDeX pin is PHB pin" mask="0x00020000" name="IDXPHB"/>
          <bitfield caption="" mask="0x00080000" name="FILTER"/>
          <bitfield caption="MAXimum FILTer" mask="0x03F00000" name="MAXFILT"/>
        </register>
        <register caption="QDEC Interrupt Enable Register" name="TC_QIER" offset="0xC8" rw="W" size="4">
          <bitfield caption="InDeX" mask="0x00000001" name="IDX"/>
          <bitfield caption="DIRection CHanGe" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature ERRor" mask="0x00000004" name="QERR"/>
        </register>
        <register caption="QDEC Interrupt Disable Register" name="TC_QIDR" offset="0xCC" rw="W" size="4">
          <bitfield caption="InDeX" mask="0x00000001" name="IDX"/>
          <bitfield caption="DIRection CHanGe" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature ERRor" mask="0x00000004" name="QERR"/>
        </register>
